SiliconLabs/amazon-sidewalk/component/amazon/projects/sid/sal/silabs/sid_pal/efr32xgxx_radio/silabs/efr32xgxx.c
/***************************************************************************//**
 * @file
 * @brief efr32xgxx.c
 *******************************************************************************
 * # License
 * <b>Copyright 2024 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 * Your use of this software is governed by the terms of
 * Silicon Labs Master Software License Agreement (MSLA)available at
 * www.silabs.com/about-us/legal/master-software-license-agreement.
 * This software contains Third Party Software licensed by Silicon Labs from
 * Amazon.com Services LLC and its affiliates and is governed by the sections
 * of the MSLA applicable to Third Party Software and the additional terms set
 * forth in amazon_sidewalk_license.txt.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *  claim that you wrote the original software. If you use this software
 *  in a product, an acknowledgment in the product documentation would be
 *  appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *  misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

// -----------------------------------------------------------------------------
//                                   Includes
// -----------------------------------------------------------------------------
#include <stdbool.h>
#include <sid_clock_ifc.h>
#include <sid_pal_delay_ifc.h>
#include <sl_rail_util_compatible_pa.h>
#if defined(SL_SIDEWALK_UNIT_TEST)
#include "sl_sidewalk_log_pal_mock.h"
#else
#include "sl_sidewalk_log_pal.h"
#endif
#include <sid_pal_assert_ifc.h>

#include "silabs/efr32xgxx.h"
#include "efr32xgxx_radio.h"
// -----------------------------------------------------------------------------
//                              Macros and Typedefs
// -----------------------------------------------------------------------------
#define TX_FIFO_SIZE                                (256) // Any power of 2 from [64, 4096] on the EFR32
#define RF_RANDOM_TIMES                             (8)
#define RSSI_QUARTER_ORDER                          (2)

#define EFR32XGXX_RADIO_WARMUP_VALUE                (220)

#define EFR32XGXX_PHR_CRC16_BYTES                   (2)
#define EFR32XGXX_PHR_CRC32_BYTES                   (4)
#define EFR32XGXX_PHR_FIELD_LEN_SHIFT_BITS          (8)
#define EFR32XGXX_PHR_FIELD_CRC_SHIFT_BITS          (4)
#define EFR32XGXX_PHR_FIELD_WHITENING_SHIFT_BITS    (3)
#define EFR32XGXX_PHR_FIELD_MODESW_SHIFT_BITS       (7)
#define EFR32XGXX_PHR_FIELD_LEN_HI_MASK             (0x07)
#define EFR32XGXX_PHR_FIELD_LEN_LO_MASK             (0xff)

#define EFR32XGXX_RAIL_MAXPOWER                     (20)

#define EFR32XGXX_RAIL_INVALID_IDX                  (-1)
#define EFR32XGXX_RAIL_50KBPS_IDX                   (0)
#define EFR32XGXX_RAIL_150KBPS_IDX                  (1)
#define EFR32XGXX_RAIL_250KBPS_IDX                  (2)

#define EFR32XGXX_SYNCWORD_BYTES                    (8)

#define EFR32XGXX_CRC_16_TYPE                       (0)
#define EFR32XGXX_CRC_32_TYPE                       (1)
#define EFR32XGXX_CRC_BYTES_ZERO                    (0)
#define EFR32XGXX_CRC_BYTES_ONE                     (1)
#define EFR32XGXX_CRC_BYTES_TWO                     (2)

#define EFR32XGXX_MAX_PAYLOAD                       (255)
#define EFR32XGXX_PHR_LOW_BYTE                      (0)
#define EFR32XGXX_PHR_HIGH_BYTE                     (1)
#define EFR32XGXX_PHR_ENABLE                        (1)

#define POLYNOMIAL_CRC16                            (0x1021)
#define POLYNOMIAL_CRC32                            (0x04C11DB7)

#if defined(SL_SIDEWALK_DMP_FSK_SUPPORTED)
// Greater the priority value, lesser the priority
#define EFR32XGXX_RX_PRIORITY                       (200)
#define EFR32XGXX_TX_PRIORITY                       (100)

// RAIL scheduler reconfigures the radio in between protocol switches
#define EFR32XGXX_RADIO_PROTOCOL_SWITCH_TIME        (4000)  // (Max BLE packet transmit time + ACK) + (2 x the protocol switch time)
#endif

/** Macro to determine array size. */
#define COMMON_UTILS_COUNTOF(a) (sizeof(a) / sizeof((a)[0]))

#define SL_RAIL_BUILTIN_TX_FIFO_BYTES 512

// -----------------------------------------------------------------------------
//                          Static Function Declarations
// -----------------------------------------------------------------------------
static void radio_irq(sl_rail_handle_t rail_handle, sl_rail_events_t events);
static uint32_t efr32xgxx_get_gfsk_crc_len_in_bytes(efr32xgxx_gfsk_crc_types_t crc_type);
static void efr32xgxx_cancel_radio_timer(void);
static void radio_cfg_changed_hander(sl_rail_handle_t rail_handle, const sl_rail_channel_config_entry_t *entry);
static void efr32xgxx_set_radio_idle(void);
static void efr32xgxx_rfready(sl_rail_handle_t rail_handle);
static void efr32xgxx_event_notify(sid_pal_radio_events_t radio_event);
static void efr32xgxx_rx_timer_expired(sl_rail_handle_t rail_handle);
static void efr32xgxx_tx_timer_expired(sl_rail_handle_t rail_handle);
#if defined(SL_SIDEWALK_DMP_FSK_SUPPORTED)
static void efr32xgxx_radio_yield(void);
#endif
// -----------------------------------------------------------------------------
//                                Global Variables
// -----------------------------------------------------------------------------
extern const sl_rail_channel_config_t *efr32xgxx_channelConfigs[]; // PHY link

sl_rail_handle_t g_rail_handle = SL_RAIL_EFR32_HANDLE;
// -----------------------------------------------------------------------------
//                                Static Variables
// -----------------------------------------------------------------------------
union g_tx_fifo_u {
  SL_RAIL_DECLARE_FIFO_BUFFER(aligned, TX_FIFO_SIZE);
  uint8_t bytes[TX_FIFO_SIZE]; // For byte accessing
};
