SiliconLabs/amazon-sidewalk/component/amazon/projects/sid/sal/silabs/sid_pal/efr32xgxx_radio/silabs/efr32xgxx.c
static union g_tx_fifo_u g_tx_fifo;
static int8_t g_last_set_tx_power_level = 0;
static uint8_t g_preamble_detected = 0;
static uint16_t g_channel = 0;
static uint32_t g_old_br_in_bps = RADIO_FSK_BR_50KBPS;
static int8_t g_rf_profile = EFR32XGXX_RAIL_50KBPS_IDX;
static bool g_platform_init_once = false;
static bool g_radio_init_once = false;
static bool g_tx_pwr_cfg_init_once = false;
static bool g_is_first_set_gfsk_mod_params = true;
static sid_pal_radio_events_t g_last_radio_event = SID_PAL_RADIO_EVENT_UNKNOWN;

// Provide weak overridable internal RX FIFO and RX Packet Buffer for
// non-UC protocols to share and for RAIL 2.x backwards compatibility.
static sl_rail_packet_queue_entry_t builtin_rx_packet_queue[SL_RAIL_BUILTIN_RX_PACKET_QUEUE_ENTRIES];
static SL_RAIL_DECLARE_FIFO_BUFFER(builtin_rx_fifo, SL_RAIL_BUILTIN_RX_FIFO_BYTES);
__WEAK sl_rail_packet_queue_entry_t * const sl_rail_builtin_rx_packet_queue_ptr = builtin_rx_packet_queue;
__WEAK sl_rail_fifo_buffer_align_t * const sl_rail_builtin_rx_fifo_ptr = builtin_rx_fifo;
__WEAK const uint16_t sl_rail_builtin_rx_packet_queue_entries = COMMON_UTILS_COUNTOF(builtin_rx_packet_queue);
__WEAK const uint16_t sl_rail_builtin_rx_fifo_bytes = sizeof(builtin_rx_fifo);

// Provide weak overridable internal RX FIFO and RX Packet Buffer for
// non-UC protocols to share and for RAIL 2.x backwards compatibility.
static SL_RAIL_DECLARE_FIFO_BUFFER(sli_tx_fifo_buffer_sidewalk, SL_RAIL_BUILTIN_TX_FIFO_BYTES);

static sl_rail_config_t rail_init_config;

#if defined(SL_SIDEWALK_DMP_FSK_SUPPORTED)
static uint16_t g_prev_channel = 0;
// For multiprotocol versions of RAIL, this can be used to control how a receive or transmit operation is run.
static sl_rail_scheduler_info_t g_schedulerInfo = {
  .priority = EFR32XGXX_TX_PRIORITY,
  .slip_time = 0,        // This value is not relevant as upper layer controlls direct radio operations thourgh the sid_pal start_rx/tx.
  .transaction_time = 0  // This value is not relevant as upper layer controlls direct radio operations thourgh the sid_pal start_rx/tx.
};
#endif

// -----------------------------------------------------------------------------
//                          Public Function Definitions
// -----------------------------------------------------------------------------
uint32_t compute_crc32(const uint8_t *buffer, uint16_t length)
{
  if (!buffer || !length) {
    return 0;
  }

  uint8_t temp_buffer[sizeof(uint32_t)] = { 0 };
  uint32_t crc32                        = 0xFFFFFFFF;
  const uint8_t *buffer_local;
  uint16_t length_local;

  if (length < sizeof(uint32_t)) {
    memcpy(temp_buffer, buffer, length);
    length_local = sizeof(uint32_t);
    buffer_local = temp_buffer;
  } else {
    length_local = length;
    buffer_local = buffer;
  }

  for (uint16_t index_buffer = 0; index_buffer < length_local; index_buffer++) {
    crc32 ^= (index_buffer < length) ? ((uint32_t)buffer_local[index_buffer] << 24) : 0x00000000;

    for (uint8_t i = 0; i < 8; i++) {
      crc32 = (crc32 & 0x80000000) ? (crc32 << 1) ^ POLYNOMIAL_CRC32 : (crc32 << 1);
    }
  }

  return ~crc32;
}

uint16_t compute_crc16(const uint8_t *buffer, uint16_t length)
{
  if (!buffer || !length) {
    return 0;
  }

  uint16_t crc16 = 0x0000;

  for (uint16_t index_buffer = 0; index_buffer < length; index_buffer++) {
    crc16 ^= ((uint16_t)buffer[index_buffer] << 8);

    for (uint8_t i = 0; i < 8; i++) {
      crc16 = (crc16 & 0x8000U) ? (crc16 << 1U) ^ POLYNOMIAL_CRC16 : (crc16 << 1U);
    }
  }

  return crc16;
}

void efr32xgxx_event_handler(void)
{
  const halo_drv_silabs_ctx_t *drv_ctx = efr32xgxx_get_drv_ctx();

  if (SID_PAL_RADIO_EVENT_UNKNOWN != g_last_radio_event) {
    drv_ctx->report_radio_event(g_last_radio_event);
  }
}

void efr32xgxx_radio_irq_process(void)
{
  efr32xgxx_event_handler();
}

uint16_t reverse16(uint16_t n)
{
  return (reverse8(n >> 8U) | (reverse8(n & 0xFFU) << 8U));
}

uint8_t reverse8(uint8_t n)
{
  n = ((0xF0U & n) >> 4U) | ((0x0FU & n) << 4U);
  n = ((0xCCU & n) >> 2U) | ((0x33U & n) << 2U);
  n = ((0xAAU & n) >> 1U) | ((0x55U & n) << 1U);
  return n;
}

uint16_t efr32xgxx_set_phr(uint8_t *hdr, uint8_t modesw, uint8_t crc, uint8_t whitening, uint16_t len)
{
  uint16_t tmp_len;
  uint8_t tmp_hdr;

  hdr[EFR32XGXX_PHR_LOW_BYTE] = hdr[EFR32XGXX_PHR_HIGH_BYTE] = 0;

  if (modesw == EFR32XGXX_PHR_ENABLE) {
    hdr[EFR32XGXX_PHR_LOW_BYTE] |= 0x1 << EFR32XGXX_PHR_FIELD_MODESW_SHIFT_BITS;
  }

  if (crc == EFR32XGXX_PHR_ENABLE) {
    hdr[EFR32XGXX_PHR_LOW_BYTE] |= (0x1 << EFR32XGXX_PHR_FIELD_CRC_SHIFT_BITS);
  }

  if (whitening == EFR32XGXX_PHR_ENABLE) {
    hdr[EFR32XGXX_PHR_LOW_BYTE] |= (0x1 << EFR32XGXX_PHR_FIELD_WHITENING_SHIFT_BITS);
  }

  tmp_len = reverse16(len);

  hdr[EFR32XGXX_PHR_LOW_BYTE] |= ((tmp_len << EFR32XGXX_PHR_FIELD_LEN_SHIFT_BITS)
                                  & EFR32XGXX_PHR_FIELD_LEN_HI_MASK);
  hdr[EFR32XGXX_PHR_HIGH_BYTE] = ((tmp_len >> EFR32XGXX_PHR_FIELD_LEN_SHIFT_BITS)
                                  & EFR32XGXX_PHR_FIELD_LEN_LO_MASK);

  tmp_hdr = reverse8(hdr[EFR32XGXX_PHR_LOW_BYTE]);

  hdr[EFR32XGXX_PHR_LOW_BYTE] = tmp_hdr;

  return len;
}

/**************************************************************************//**
 * Return RAIL handle object.
 *****************************************************************************/
sl_rail_handle_t efr32xgxx_get_railhandle(void)
{
  return g_rail_handle;
}

/**************************************************************************//**
 * Handle received packets.
 *****************************************************************************/
uint16_t efr32xgxx_get_rxpacket(uint8_t *phr, uint8_t *payload, int8_t *rssi, bool msb)
{
  sl_rail_rx_packet_info_t pktinfo;
  sl_rail_rx_packet_details_t pktDetails;
  sl_rail_rx_packet_handle_t pktHandle;
  uint16_t len = 0;
  sl_rail_status_t status;

  pktHandle = sl_rail_get_rx_packet_info(g_rail_handle, SL_RAIL_RX_PACKET_HANDLE_OLDEST, &pktinfo);
  if (!(pktHandle != SL_RAIL_RX_PACKET_HANDLE_INVALID)
      || ((pktinfo.packet_status != SL_RAIL_RX_PACKET_READY_SUCCESS)
          && (pktinfo.packet_status != SL_RAIL_RX_PACKET_READY_CRC_ERROR))) {
    SL_SID_LOG_PAL_ERROR("pal rail: unexpected RX pkt status: %d", pktinfo.packet_status);
    goto ret;
  }

  status = sl_rail_get_rx_packet_details(g_rail_handle, pktHandle, &pktDetails);
  if (status != SL_RAIL_STATUS_NO_ERROR) {
    SL_SID_LOG_PAL_ERROR("pal rail: get RX pkt detail err: %d", status);
    goto ret;
  }

  if (pktinfo.packet_bytes <= EFR32XGXX_MAX_PAYLOAD) {
    uint16_t peek_len = sl_rail_peek_rx_packet(g_rail_handle, pktHandle, payload, pktinfo.packet_bytes, 0);
    if (peek_len != pktinfo.packet_bytes) {
      SL_SID_LOG_PAL_ERROR("pal rail: RX pkt len not consistent: %d", peek_len);
      goto ret;
    }

    memcpy(phr, payload, EFR32XGXX_PHR_LENGTH);

    if (msb) {
      for (uint16_t i = 0; i < pktinfo.packet_bytes - EFR32XGXX_PHR_LENGTH; i++) {
        payload[i] = reverse8(payload[i + EFR32XGXX_PHR_LENGTH]);
      }
    } else {
      SL_SID_LOG_PAL_ERROR("pal rail: unsupported endianness");
      goto ret;
    }
  } else {
    SL_SID_LOG_PAL_ERROR("pal rail: RX pkt len more than supported: %d", pktinfo.packet_bytes);
    goto ret;
  }

  len = reverse16((phr[EFR32XGXX_PHR_LOW_BYTE] << EFR32XGXX_PHR_FIELD_LEN_SHIFT_BITS
                   | phr[EFR32XGXX_PHR_HIGH_BYTE]));
  len = ((len & EFR32XGXX_PHR_FIELD_LEN_HI_MASK) << EFR32XGXX_PHR_FIELD_LEN_SHIFT_BITS)
        | ((len >> EFR32XGXX_PHR_FIELD_LEN_SHIFT_BITS) & EFR32XGXX_PHR_FIELD_LEN_LO_MASK);
  *rssi = pktDetails.rssi_dbm;

