SiliconLabs/amazon-sidewalk/component/amazon/projects/sid/sal/silabs/sid_pal/efr32xgxx_radio/silabs/efr32xgxx.c
  ret:
  return len;
}

/**************************************************************************//**
 * RAIL init.
 *****************************************************************************/
int32_t efr32xgxx_set_platform(void)
{
  int32_t err = RADIO_ERROR_NONE;
  sl_rail_status_t status;

  if (g_platform_init_once) {
    // Already initialized
    err = RADIO_ERROR_NONE;
    goto ret;
  }

  // Initialize the rail_init_config structure
  rail_init_config.events_callback = &radio_irq;
  rail_init_config.rx_packet_queue_entries = sl_rail_builtin_rx_packet_queue_entries;
  rail_init_config.rx_fifo_bytes = sl_rail_builtin_rx_fifo_bytes;
  rail_init_config.p_rx_packet_queue = sl_rail_builtin_rx_packet_queue_ptr;
  rail_init_config.p_rx_fifo_buffer = sl_rail_builtin_rx_fifo_ptr;
  rail_init_config.tx_fifo_bytes = SL_RAIL_BUILTIN_TX_FIFO_BYTES;
  rail_init_config.tx_fifo_init_bytes = 0U;
  rail_init_config.p_tx_fifo_buffer = sli_tx_fifo_buffer_sidewalk;

  // initializes the RAIL core
  status = sl_rail_init(&g_rail_handle, &rail_init_config, &efr32xgxx_rfready);

  if(SL_RAIL_STATUS_NO_ERROR != status) {
    SL_SID_LOG_PAL_ERROR("pal rail: sl_rail_init failed, return value: %ld", status);
    err = RADIO_ERROR_HARDWARE_ERROR;
    goto ret;
  } else if(NULL == g_rail_handle) {
    SL_SID_LOG_PAL_ERROR("pal rail: sl_rail_init failed, return value: %ld", status);
    // Handle is null, no reason to call sl_rail_idle
    return RADIO_ERROR_HARDWARE_ERROR;
  }

  while (!sl_rail_is_initialized(g_rail_handle)) {
    // Wait for RAIL init...
  }

  // Platform is initialized
  g_platform_init_once = true;

  ret:
  sl_rail_idle(g_rail_handle, SL_RAIL_IDLE, true);
  return err;
}

/**************************************************************************//**
 * Radio calibration.
 *****************************************************************************/
int32_t efr32xgxx_set_radio_init_hard(void)
{
  int32_t err = RADIO_ERROR_NONE;
  sl_rail_status_t status;

  if (g_radio_init_once) {
    // Already calibrated
    err = RADIO_ERROR_NONE;
    goto ret;
  }

  if (g_rf_profile == EFR32XGXX_RAIL_INVALID_IDX) {
    SL_SID_LOG_PAL_ERROR("pal rail: wrong RF profile: %d", g_rf_profile);
    err = RADIO_ERROR_HARDWARE_ERROR;
    goto ret;
  }

  // Enable the PA calibration
  sl_rail_enable_pa_cal(g_rail_handle, true);

  // Initialize RAIL calibration
  status = sl_rail_config_cal(g_rail_handle, SL_RAIL_CAL_TEMP);
  if (status != SL_RAIL_STATUS_NO_ERROR) {
    SL_SID_LOG_PAL_ERROR("pal rail: calib cfg err: %d", status);
    err = RADIO_ERROR_HARDWARE_ERROR;
    goto ret;
  }

  // Image Rejection Calibration (IRCAL)
  status = sl_rail_calibrate(g_rail_handle, NULL, SL_RAIL_CAL_ONETIME_IR_CAL);
  if (status != SL_RAIL_STATUS_NO_ERROR) {
    SL_SID_LOG_PAL_ERROR("pal rail: calib err: %d", status);
    err = RADIO_ERROR_HARDWARE_ERROR;
    goto ret;
  }

  // Radio is initialized
  g_radio_init_once = true;

  ret:
  return err;
}

/**************************************************************************//**
 * Radio configuration.
 *****************************************************************************/
int32_t efr32xgxx_set_radio_init(void)
{
  int32_t err = RADIO_ERROR_NONE;
  sl_rail_status_t status;

  status = sl_rail_config_channels(g_rail_handle, efr32xgxx_channelConfigs[g_rf_profile], &radio_cfg_changed_hander);
  if (status != SL_RAIL_STATUS_NO_ERROR) {
    SL_SID_LOG_PAL_ERROR("pal rail: sl_rail_config_channels failed with error code %ld\n", status);
    err = RADIO_ERROR_HARDWARE_ERROR;
    goto ret;
  }
  if(efr32xgxx_channelConfigs[g_rf_profile] != NULL)
  {
    uint16_t new_channel = sl_rail_get_first_channel(g_rail_handle, efr32xgxx_channelConfigs[g_rf_profile]);
    if(new_channel != SL_RAIL_CHANNEL_INVALID) {
      status = sl_rail_prepare_channel(g_rail_handle, new_channel);
      if (status != SL_RAIL_STATUS_NO_ERROR) {
        SL_SID_LOG_PAL_ERROR("pal rail: sl_rail_prepare_channel failed with error code %ld\n", status);
        err = RADIO_ERROR_HARDWARE_ERROR;
        goto ret;
      }
    } else {
      err = RADIO_ERROR_HARDWARE_ERROR;
      goto ret;
    }
  }

  err = efr32xgxx_set_radio_init_hard();
  if (err != RADIO_ERROR_NONE) {
    err = RADIO_ERROR_HARDWARE_ERROR;
    goto ret;
  }

  sl_rail_events_t events = SL_RAIL_EVENT_CAL_NEEDED
                         | SL_RAIL_EVENT_RX_PACKET_RECEIVED
                         | SL_RAIL_EVENT_RX_FRAME_ERROR
                         | SL_RAIL_EVENT_RX_FIFO_OVERFLOW
                         | SL_RAIL_EVENT_RX_PACKET_ABORTED
                         | SL_RAIL_EVENT_TX_PACKET_SENT
                         | SL_RAIL_EVENT_TX_ABORTED
                         | SL_RAIL_EVENT_TX_BLOCKED
                         | SL_RAIL_EVENT_TX_UNDERFLOW
                         | SL_RAIL_EVENT_RX_PREAMBLE_DETECT;

  // Configure radio events
  status = sl_rail_config_events(g_rail_handle, SL_RAIL_EVENTS_ALL, events);
  if (status != SL_RAIL_STATUS_NO_ERROR) {
    SL_SID_LOG_PAL_ERROR("pal rail: evts cfg err: %d", status);
    err = RADIO_ERROR_HARDWARE_ERROR;
    goto ret;
  }

  uint16_t allocated_tx_fifo_size = TX_FIFO_SIZE;
  status = sl_rail_set_tx_fifo(g_rail_handle, g_tx_fifo.aligned, allocated_tx_fifo_size, 0, 0);
  if (status != SL_RAIL_STATUS_NO_ERROR) {
    SL_SID_LOG_PAL_ERROR("pal rail: sl_rail_set_tx_fifo() failed with error code %lx\n", status);
    err = RADIO_ERROR_HARDWARE_ERROR;
    goto ret;
  }

  status = sl_rail_init_power_manager();
  if (status != SL_RAIL_STATUS_NO_ERROR) {
    SL_SID_LOG_PAL_ERROR("pal rail: pwr mngr init err: %d", status);
    err = RADIO_ERROR_HARDWARE_ERROR;
    goto ret;
  }

  sl_rail_timer_sync_config_t timer_sync_config = SL_RAIL_TIMER_SYNC_DEFAULT;
  timer_sync_config.sleep = SL_RAIL_SLEEP_CONFIG_TIMERSYNC_ENABLED;

  status = sl_rail_config_sleep(g_rail_handle, &timer_sync_config);
  if (status != SL_RAIL_STATUS_NO_ERROR) {
    SL_SID_LOG_PAL_ERROR("pal rail: sl_rail_config_sleep err: %d", status);
    err = RADIO_ERROR_HARDWARE_ERROR;
    goto ret;
  }

