SiliconLabs/amazon-sidewalk/component/amazon/projects/sid/sal/silabs/sid_pal/efr32xgxx_radio/silabs/efr32xgxx.c
  ret:
  return err;
}

void efr32xgxx_get_txpower(int8_t *max_tx_power, int8_t *min_tx_power)
{
  sl_rail_status_t status;

  sl_rail_tx_power_t min_power_ddbm = 0;
  sl_rail_tx_power_t max_power_ddbm = 0;
  sl_rail_tx_power_t step_power_ddbm = 0;

  status = sl_rail_util_pa_get_tx_power_limits(g_rail_handle,
                                               SL_RAIL_TX_PA_MODE_SUB_GHZ,
                                               &min_power_ddbm,
                                               &max_power_ddbm,
                                               &step_power_ddbm);
  if (status != SL_RAIL_STATUS_NO_ERROR) {
    SL_SID_LOG_PAL_ERROR("pal rail: sl_rail_util_pa_get_tx_power_limits failed with error code %lx\n", status);
    return;
  }

  if (max_tx_power) {
    *max_tx_power = (int8_t) (max_power_ddbm / 10);
  }
  if (min_tx_power) {
    *min_tx_power = (int8_t) (min_power_ddbm / 10);
  }
}

int32_t efr32xgxx_set_txpower(int8_t power)
{
  sl_rail_status_t status;
  int32_t err = RADIO_ERROR_NONE;

  if (!g_tx_pwr_cfg_init_once) {
    status = sl_rail_util_pa_post_init(g_rail_handle, SL_RAIL_TX_PA_MODE_SUB_GHZ);
    if (status != SL_RAIL_STATUS_NO_ERROR) {
      SL_SID_LOG_PAL_ERROR("pal rail: PA init err: %d", status);
      err = RADIO_ERROR_HARDWARE_ERROR;
      goto ret;
    }
  }

  if (power != g_last_set_tx_power_level) {
    int8_t max_pwr = 0;

    efr32xgxx_get_txpower(&max_pwr, NULL);
    if (power > max_pwr) {
      power = max_pwr;
    }

    sl_rail_tx_power_t powerLevelDeciDbm = (int16_t)power * 10; // convert from dBm to deci-dBm
    status = sl_rail_set_tx_power_dbm(g_rail_handle, powerLevelDeciDbm);
    if (status != SL_RAIL_STATUS_NO_ERROR) {
      SL_SID_LOG_PAL_ERROR("pal rail: set TX pwr err: %d", status);
      err = RADIO_ERROR_HARDWARE_ERROR;
      goto ret;
    }

    g_last_set_tx_power_level = power;
  }

  g_tx_pwr_cfg_init_once = true;

  ret:
  return err;
}

int32_t efr32xgxx_set_sleep(void)
{
#if defined(SL_SIDEWALK_DMP_FSK_SUPPORTED)
  efr32xgxx_radio_yield();
#else
  efr32xgxx_set_radio_idle();
#endif
  return RADIO_ERROR_NONE;
}

int32_t efr32xgxx_set_standby(void)
{
#if defined(SL_SIDEWALK_DMP_FSK_SUPPORTED)
  efr32xgxx_radio_yield();
#else
  efr32xgxx_set_radio_idle();
#endif
  return RADIO_ERROR_NONE;
}

int32_t efr32xgxx_set_tx_payload(const uint8_t *buffer, uint8_t size, bool msb)
{
  uint8_t data[EFR32XGXX_FSK_MAX_PAYLOAD_LENGTH] = { 0 };
  uint8_t *payload = data;
  int32_t err = RADIO_ERROR_NONE;

  if (msb) {
    memcpy(payload, buffer, EFR32XGXX_PHR_LENGTH);
    for (uint16_t i = EFR32XGXX_PHR_LENGTH; i < size; i++) {
      payload[i] = reverse8(buffer[i]);
    }
  } else {
    payload = (uint8_t *)buffer;
  }

  if (!sl_rail_write_tx_fifo(g_rail_handle, payload, size, true)) {
    SL_SID_LOG_PAL_ERROR("pal rail: write TX fifo err");
    err = RADIO_ERROR_HARDWARE_ERROR;
    goto ret;
  }

  ret:
  return err;
}

int32_t efr32xgxx_set_tx(const uint32_t timeout)
{
  int32_t err = RADIO_ERROR_NONE;

#if defined(SL_SIDEWALK_DMP_FSK_SUPPORTED)
  efr32xgxx_cancel_radio_timer();
#else
  efr32xgxx_set_radio_idle();
#endif

  // Start sending
#if defined(SL_SIDEWALK_DMP_FSK_SUPPORTED)
  g_schedulerInfo = (sl_rail_scheduler_info_t) { .priority = EFR32XGXX_TX_PRIORITY }; // TX priority value shall be less than TX
  sl_rail_status_t status = sl_rail_start_tx(g_rail_handle, g_channel, SL_RAIL_TX_OPTION_ALT_PREAMBLE_LEN, &g_schedulerInfo);
#else
  sl_rail_status_t status = sl_rail_start_tx(g_rail_handle, g_channel, SL_RAIL_TX_OPTION_ALT_PREAMBLE_LEN, NULL);
#endif
  if (status != SL_RAIL_STATUS_NO_ERROR) {
    SL_SID_LOG_PAL_ERROR("pal rail: start sch TX err: %d", status);
    err = RADIO_ERROR_HARDWARE_ERROR;
    goto ret;
  }

  if (timeout) {
#if defined(SL_SIDEWALK_DMP_FSK_SUPPORTED)
    status = sl_rail_set_timer(g_rail_handle,
                           timeout + EFR32XGXX_RADIO_WARMUP_VALUE + EFR32XGXX_RADIO_PROTOCOL_SWITCH_TIME,
                           SL_RAIL_TIME_DELAY,
                           &efr32xgxx_tx_timer_expired);
#else
    status = sl_rail_set_timer(g_rail_handle, timeout + EFR32XGXX_RADIO_WARMUP_VALUE, SL_RAIL_TIME_DELAY, &efr32xgxx_tx_timer_expired);
#endif
    if (status != SL_RAIL_STATUS_NO_ERROR) {
      SL_SID_LOG_PAL_ERROR("pal rail: set tmr err: %d", status);
      err = RADIO_ERROR_HARDWARE_ERROR;
      goto ret;
    }
  }

  ret:
  return err;
}

int32_t efr32xgxx_set_rx(const uint32_t timeout)
{
  // timeout 0 is continuous receive
  int32_t err = RADIO_ERROR_NONE;
  uint32_t rail_timeout = timeout;
  sl_rail_status_t status = SL_RAIL_STATUS_NO_ERROR;

  g_preamble_detected = 0;

#if defined(SL_SIDEWALK_DMP_FSK_SUPPORTED)
  // Check if channel has changed
  // If we call sl_rail_start_rx while not idle but with a different channel, any ongoing receive or transmit operation will be aborted
  if (g_prev_channel != g_channel) {
    efr32xgxx_set_radio_idle();
  } else {
    efr32xgxx_cancel_radio_timer();
  }
#else
  efr32xgxx_set_radio_idle();
#endif

#if defined(SL_SIDEWALK_DMP_FSK_SUPPORTED)
  // Start backround RX
  g_schedulerInfo = (sl_rail_scheduler_info_t) { .priority = EFR32XGXX_RX_PRIORITY }; // RX priority value shall be greater than TX
  status = sl_rail_start_rx(g_rail_handle, g_channel, &g_schedulerInfo);
#else
  // Start RX
  status = sl_rail_start_rx(g_rail_handle, g_channel, NULL);
#endif
  if (status != SL_RAIL_STATUS_NO_ERROR) {
    SL_SID_LOG_PAL_ERROR("pal rail: schedule RX err: %d", status);
    err = RADIO_ERROR_HARDWARE_ERROR;
    goto ret;
  }

#if defined(SL_SIDEWALK_DMP_FSK_SUPPORTED)
  // Update prev channel
  g_prev_channel = g_channel;
#endif

  if (rail_timeout) {
#if defined(SL_SIDEWALK_DMP_FSK_SUPPORTED)
    status = sl_rail_set_timer(g_rail_handle,
                               rail_timeout + EFR32XGXX_RADIO_WARMUP_VALUE + EFR32XGXX_RADIO_PROTOCOL_SWITCH_TIME,
                               SL_RAIL_TIME_DELAY,
                               &efr32xgxx_rx_timer_expired);
#else
    status = sl_rail_set_timer(g_rail_handle, rail_timeout + EFR32XGXX_RADIO_WARMUP_VALUE, SL_RAIL_TIME_DELAY, &efr32xgxx_rx_timer_expired);
#endif
    if (status != SL_RAIL_STATUS_NO_ERROR) {
      SL_SID_LOG_PAL_ERROR("pal rail: set tmr err: %d", status);
      err = RADIO_ERROR_HARDWARE_ERROR;
      goto ret;
    }
  }

