SiliconLabs/amazon-sidewalk/component/amazon/projects/sid/sal/silabs/sid_pal/efr32xgxx_radio/silabs/efr32xgxx.c
  ret:
  return err;
}

// This function is not supported.
int32_t efr32xgxx_set_tx_cw(void)
{
  return RADIO_ERROR_NOT_SUPPORTED;
}

// This function is not supported.
int32_t efr32xgxx_set_tx_cpbl(void)
{
  return RADIO_ERROR_NOT_SUPPORTED;
}

int32_t efr32xgxx_set_rf_freq(const uint32_t freq_in_hz)
{
  // Compute channel from frequency
  g_channel = (uint16_t)((freq_in_hz - efr32xgxx_channelConfigs[g_rf_profile]->p_entries->base_frequency_hz) / efr32xgxx_channelConfigs[g_rf_profile]->p_entries->channel_spacing_hz);

  return RADIO_ERROR_NONE;
}

int32_t efr32xgxx_set_gfsk_mod_params(const efr32xgxx_mod_params_gfsk_t *params)
{
  int32_t err = RADIO_ERROR_NONE;

  if (g_is_first_set_gfsk_mod_params) {
    g_is_first_set_gfsk_mod_params = false;
    goto ret;
  }

  if (params->br_in_bps != g_old_br_in_bps) {
    if (params->br_in_bps == RADIO_FSK_BR_50KBPS) {
      g_rf_profile = EFR32XGXX_RAIL_50KBPS_IDX;
    } else if (params->br_in_bps == RADIO_FSK_BR_150KBPS) {
      g_rf_profile = EFR32XGXX_RAIL_150KBPS_IDX;
    } else if (params->br_in_bps == RADIO_FSK_BR_250KBPS) {
      g_rf_profile = EFR32XGXX_RAIL_250KBPS_IDX;
    } else {
      SL_SID_LOG_PAL_ERROR("pal rail: wrong RF profile: %d", g_rf_profile);
      g_rf_profile = EFR32XGXX_RAIL_INVALID_IDX;
      err = RADIO_ERROR_HARDWARE_ERROR;
      goto ret;
    }
  }

  if (efr32xgxx_set_standby() != RADIO_ERROR_NONE) {
    err = RADIO_ERROR_HARDWARE_ERROR;
    goto ret;
  }

  if (efr32xgxx_set_radio_init() != RADIO_ERROR_NONE) {
    err = RADIO_ERROR_HARDWARE_ERROR;
    goto ret;
  }

  g_old_br_in_bps = params->br_in_bps;

  ret:
  return err;
}

int32_t efr32xgxx_set_gfsk_pkt_params(const efr32xgxx_pkt_params_gfsk_t *params)
{
  int32_t err = RADIO_ERROR_NONE;
  sl_rail_status_t status;

  status = sl_rail_set_tx_alt_preamble_length(g_rail_handle, params->pbl_len_in_bits);
  if (status != SL_RAIL_STATUS_NO_ERROR) {
    SL_SID_LOG_PAL_ERROR("pal rail: preamble set err: %d (bits: %d)", status, params->pbl_len_in_bits);
    err = RADIO_ERROR_HARDWARE_ERROR;
    goto ret;
  }

  ret:
  return err;
}

int32_t efr32xgxx_get_rssi_inst(int16_t *rssi_in_dbm)
{
  int16_t rssi_local;
  int32_t err = RADIO_ERROR_NONE;
  sl_rail_time_t timeout;

  // 'wait' should never be set 'true' in multiprotocol as the wait time is not consistent,
  // so scheduling a scheduler slot cannot be done accurately.
#if defined(SL_SIDEWALK_DMP_FSK_SUPPORTED)
  timeout = SL_RAIL_GET_RSSI_NO_WAIT;
#else
  timeout = SL_RAIL_GET_RSSI_WAIT_WITHOUT_TIMEOUT;
#endif

  if ((rssi_local = sl_rail_get_rssi(g_rail_handle, timeout)) == SL_RAIL_RSSI_INVALID) {
    err = RADIO_ERROR_HARDWARE_ERROR;
    goto ret;
  }
  *rssi_in_dbm = (rssi_local >> RSSI_QUARTER_ORDER);

  ret:
  return err;
}

uint32_t efr32xgxx_get_gfsk_time_on_air_numerator(const efr32xgxx_pkt_params_gfsk_t *pkt_p)
{
  return pkt_p->pbl_len_in_bits
         + (pkt_p->hdr_type == EFR32XGXX_GFSK_PKT_VAR_LEN ? 8 : 0)
         + pkt_p->sync_word_len_in_bits
         + ((pkt_p->pld_len_in_bytes
             + (pkt_p->addr_cmp == EFR32XGXX_GFSK_ADDR_CMP_FILT_OFF ? 0 : 1)
             + efr32xgxx_get_gfsk_crc_len_in_bytes(pkt_p->crc_type)) << 3);
}

uint32_t efr32xgxx_get_gfsk_time_on_air_in_ms(const efr32xgxx_pkt_params_gfsk_t *pkt_p,
                                              const efr32xgxx_mod_params_gfsk_t *mod_p)
{
  uint32_t numerator   = MS_IN_SEC * efr32xgxx_get_gfsk_time_on_air_numerator(pkt_p);
  uint32_t denominator = mod_p->br_in_bps;

  // Perform integral ceil()
  return (numerator + denominator - 1) / denominator;
}

int32_t efr32xgxx_get_random_numbers(uint32_t *numbers, unsigned int n)
{
  int8_t seed = 0;
  int8_t cnt = 0;
  int8_t err_cnt = 0;
  int16_t rssi;
  uint32_t noise = 0;
  uint32_t r_val = 0;
  int32_t err = RADIO_ERROR_NONE;

  if (n < 1) {
    n = 1;
  }

  do {
    sid_pal_delay_us(n);
    if (((rssi = sid_pal_radio_rssi()) == 0) || (rssi == INT16_MAX)) {
      if (err_cnt++ > RSSI_ERROR_COUNT) {
        err = RADIO_ERROR_HARDWARE_ERROR;
        goto ret;
      }
      continue;
    }

    noise += (-1 * rssi);
    seed = (noise % 8);
    r_val |= (((noise % 16) & 0xf) << (((seed + cnt) % 8) * 4));
    r_val |= noise;
    cnt++;
  } while (RF_RANDOM_TIMES > cnt);
  *numbers = r_val;

  ret:
  return err;
}

int32_t efr32xgxx_set_gfsk_sync_word(const uint8_t* sync_word, const uint8_t sync_word_len)
{
  (void)sync_word;
  (void)sync_word_len;
  return RADIO_ERROR_NONE;
}

// -----------------------------------------------------------------------------
//                          Static Function Definitions
// -----------------------------------------------------------------------------
static uint32_t efr32xgxx_get_gfsk_crc_len_in_bytes(efr32xgxx_gfsk_crc_types_t crc_type)
{
  switch (crc_type) {
    case EFR32XGXX_GFSK_CRC_OFF:
      return EFR32XGXX_CRC_BYTES_ZERO;
    case EFR32XGXX_GFSK_CRC_1_BYTE:
    case EFR32XGXX_GFSK_CRC_1_BYTE_INV:
      return EFR32XGXX_CRC_BYTES_ONE;
    case EFR32XGXX_GFSK_CRC_2_BYTES:
    case EFR32XGXX_GFSK_CRC_2_BYTES_INV:
      return EFR32XGXX_CRC_BYTES_TWO;
  }

  return EFR32XGXX_CRC_BYTES_ZERO;
}

static void radio_cfg_changed_hander(sl_rail_handle_t rail_handle, const sl_rail_channel_config_entry_t *entry)
{
  (void)rail_handle;
  (void)entry;

  efr32xgxx_set_txpower(g_last_set_tx_power_level);
}

static void efr32xgxx_set_radio_idle(void)
{
  efr32xgxx_cancel_radio_timer();
  sl_rail_idle(g_rail_handle, SL_RAIL_IDLE, true);
}

#if defined(SL_SIDEWALK_DMP_FSK_SUPPORTED)
static void efr32xgxx_radio_yield(void)
{
  efr32xgxx_cancel_radio_timer();
  sl_rail_yield_radio(g_rail_handle);
}
#endif

static void efr32xgxx_cancel_radio_timer(void)
{
  if (sl_rail_is_timer_running(g_rail_handle)) {
    sl_rail_cancel_timer(g_rail_handle);
  }
}

/**************************************************************************//**
 * A callback that notifies the application
 * when the radio is finished initializing
 * and is ready for further configuration.
 *****************************************************************************/
static void efr32xgxx_rfready(sl_rail_handle_t rail_handle)
{
  (void)rail_handle;
}

static void efr32xgxx_event_notify(sid_pal_radio_events_t radio_event)
{
  const halo_drv_silabs_ctx_t *drv_ctx = efr32xgxx_get_drv_ctx();

  g_last_radio_event = radio_event;

  drv_ctx->irq_handler();
}

// to mimic semtech behaviour
static void radio_irq(sl_rail_handle_t rail_handle, sl_rail_events_t events)
{
  sl_rail_status_t status;

  //----------------- RX --------------------------
  // Handle RX Events
  if (events & SL_RAIL_EVENT_RX_PACKET_RECEIVED) {
    halo_drv_silabs_ctx_t *drv_ctx = efr32xgxx_get_drv_ctx();

    sid_clock_now(SID_CLOCK_SOURCE_UPTIME, &drv_ctx->radio_rx_packet->rcv_tm, NULL);
    if (radio_fsk_process_rx_done(drv_ctx) == RADIO_ERROR_NONE) {
      memset(&drv_ctx->radio_rx_packet->lora_rx_packet_status, 0, sizeof(sid_pal_radio_lora_rx_packet_status_t));
      efr32xgxx_event_notify(SID_PAL_RADIO_EVENT_RX_DONE);
    } else {
      SL_SID_LOG_PAL_ERROR("pal rail: pkt rcv err");
      efr32xgxx_event_notify(SID_PAL_RADIO_EVENT_RX_ERROR);
    }

    efr32xgxx_set_radio_idle();
  } else if (events & SL_RAIL_EVENT_RX_PREAMBLE_DETECT) {
    halo_drv_silabs_ctx_t *drv_ctx = efr32xgxx_get_drv_ctx();

    if (drv_ctx->cad_exit_mode == SID_PAL_RADIO_CAD_EXIT_MODE_CS_LBT) {
      // listen before talk has detected activity on current channel
      // report this event to stack
      drv_ctx->radio_rx_packet->fsk_rx_packet_status.rssi_sync = (int8_t)sid_pal_radio_rssi();
      drv_ctx->cad_exit_mode = SID_PAL_RADIO_CAD_EXIT_MODE_NONE;
#if defined(SL_SIDEWALK_DMP_FSK_SUPPORTED)
      efr32xgxx_set_radio_idle();
#endif
      efr32xgxx_event_notify(SID_PAL_RADIO_EVENT_CS_DONE);
    }

    g_preamble_detected = 1;
  } else if (events & (SL_RAIL_EVENT_RX_FIFO_OVERFLOW | SL_RAIL_EVENT_RX_PACKET_ABORTED | SL_RAIL_EVENT_RX_FRAME_ERROR)) {
    if (events & SL_RAIL_EVENT_RX_FIFO_OVERFLOW) {
#if defined(SL_SIDEWALK_DMP_FSK_SUPPORTED)
      efr32xgxx_set_radio_idle();
#endif
      SL_SID_LOG_PAL_ERROR("pal rail: RX fifo overflow");
      efr32xgxx_event_notify(SID_PAL_RADIO_EVENT_RX_ERROR);
    }

