SiliconLabs/amazon-sidewalk/component/amazon/projects/sid/sal/silabs/sid_pal/efr32xgxx_radio/silabs/efr32xgxx.c
    if (events & SL_RAIL_EVENT_RX_PACKET_ABORTED) {
#if defined(SL_SIDEWALK_DMP_FSK_SUPPORTED)
      efr32xgxx_set_radio_idle();
#endif
      SL_SID_LOG_PAL_ERROR("pal rail: RX pkt abort");
      efr32xgxx_event_notify(SID_PAL_RADIO_EVENT_RX_ERROR);
    }

    if (events & SL_RAIL_EVENT_RX_FRAME_ERROR) {
#if defined(SL_SIDEWALK_DMP_FSK_SUPPORTED)
      efr32xgxx_set_radio_idle();
#endif
      SL_SID_LOG_PAL_ERROR("pal rail: RX frame err");
      efr32xgxx_event_notify(SID_PAL_RADIO_EVENT_RX_ERROR);
    }
  }

  //----------------- TX --------------------------
  // Handle TX Events
  if (events & (SL_RAIL_EVENT_TX_ABORTED | SL_RAIL_EVENT_TX_BLOCKED | SL_RAIL_EVENT_TX_UNDERFLOW)) {
    SL_SID_LOG_PAL_ERROR("pal rail: TX err");
    efr32xgxx_event_notify(SID_PAL_RADIO_EVENT_TX_TIMEOUT);
#if defined(SL_SIDEWALK_DMP_FSK_SUPPORTED)
    efr32xgxx_radio_yield();
#else
    efr32xgxx_set_radio_idle();
#endif
  } else if (events & SL_RAIL_EVENT_TX_PACKET_SENT) {
    efr32xgxx_event_notify(SID_PAL_RADIO_EVENT_TX_DONE);
#if defined(SL_SIDEWALK_DMP_FSK_SUPPORTED)
    efr32xgxx_radio_yield();
#else
    efr32xgxx_set_radio_idle();
#endif
  }

  // Perform temperature calibration when needed
  if (events & SL_RAIL_EVENT_CAL_NEEDED) {
    sl_rail_cal_mask_t pending_calib = sl_rail_get_pending_cal(rail_handle);
    if (pending_calib & SL_RAIL_CAL_TEMP) {
      status = sl_rail_calibrate_temp(rail_handle);
      if (status != SL_RAIL_STATUS_NO_ERROR) {
        SL_SID_LOG_PAL_ERROR("pal rail: temp calib err: %d", status);
      }
    }
  }
}

static void efr32xgxx_tx_timer_expired(sl_rail_handle_t rail_handle)
{
  (void)rail_handle;
  efr32xgxx_event_notify(SID_PAL_RADIO_EVENT_TX_TIMEOUT);
#if defined(SL_SIDEWALK_DMP_FSK_SUPPORTED)
  efr32xgxx_radio_yield();
#else
  efr32xgxx_set_radio_idle();
#endif
}

static void efr32xgxx_rx_timer_expired(sl_rail_handle_t rail_handle)
{
  (void)rail_handle;
  halo_drv_silabs_ctx_t *drv_ctx = efr32xgxx_get_drv_ctx();

  if (!g_preamble_detected) {
    if (drv_ctx->cad_exit_mode == SID_PAL_RADIO_CAD_EXIT_MODE_CS_LBT) {
      // rx window was a listen before talk
      // channel is free so we can schedule tx
      drv_ctx->cad_exit_mode = SID_PAL_RADIO_CAD_EXIT_MODE_NONE;
      efr32xgxx_event_notify(SID_PAL_RADIO_EVENT_UNKNOWN);
      sid_pal_radio_start_tx(0);
      return;
    }
    // for standard rx windows, report timeout event
    efr32xgxx_event_notify(SID_PAL_RADIO_EVENT_RX_TIMEOUT);
    // switch radio mode
    efr32xgxx_set_radio_idle();
  } else {
    // preamble have been received since start of the rx window
    // continue rx until SL_RAIL_EVENT_RX_PACKET_RECEIVED event
  }
}
